//Определить количество символов 

Console.Write("Введите слово и нажмите Enter ");

string string1 = Console.ReadLine();
int arg1 = Convert.ToInt32(string1);

Console.WriteLine ("Вторая цифра данного числа - это");
Console.WriteLine(string1[1]);
